Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/legislation.html.txt.tmx
Source language: en
Languages: ga

source: Apart from the European Union, the Oireachtas is the only institution in Ireland with power to make laws for the State
ga: Taobh amuigh de Aontas na hEorpa, níl an chumhacht ag aon institiúid dlíthe a dhéanamh don Stát seo ach amháin ag an Oireachtas

source: The Oireachtas consists of the President, and the 2 Houses of the Oireachtas: Dáil Eireann and Seanad Eireann
ga: San Oireachtas tá an tUachtarán, agus 2 theach an Oireachtais: Dáil Éireann agus Seanad Éireann

source: A new law starts life as a Bill
ga: Bille a thugtar ar dhlí nua i dtosach

source: A Bill is a proposal for legislation
ga: Moladh chun reachtú atá sa bhille

source: Apart from Private Members' Bills, Bills are usually initiated by the Government
ga: Is iad an Rialtas, de ghnáth, a mholann Bille ach amháin i gcás Billí na mBall Príobháideach

source: A Bill may be commenced in either the Dáil or the Seanad but it must be passed by both Houses to become law
ga: Is féidir le bille teacht ón Dáil nó ón Seanad ach ní mór don dá theach é a cheadú sula ndéantar dlí de

source: Usually, Bills are commenced in Dáil Eireann
ga: Is ó Dháil Éireann, de ghnáth, a thagann na billí

source: Usually there will be a process of consultation with government departments and groups likely to be affected by the Bill
ga: Ceadaíonn an Rialtas a bhfuil sa Bhille sula gcuirtear ós cómhair na Dála é

source: (Examples of these groups are voluntary organisations, lobby groups or members of the public.)
ga: Bíonn próiséas caidrimh ann, de ghnáth, ar dtús leis na ranna rialtais agus le grúpaí éagsúla go mbaineann an bille leo

source: Sometimes, the Government will publish a Green Paper
ga: Uaireanta, foilsíonn an Rialtas Paipéar Glas

source: A Green Paper is a discussion document setting out ideas and inviting comment and views from individuals and relevant organisations
ga: Sa Phaipéar Glas tugtar deis do dhaoine agus do ghrúpaí éagsula a dtuairm a thabhairt faoin mBille agus é a phlé go mion

source: The Bill is then put before the Dáil for a general debate on the principles of the Bill
ga: Cuirtear an Bille ansin ós cómhair na Dála le deis a thabhairt do Bhaill iomlán na Dála an Bille a phlé

source: Members of the Dáil may make suggestions for amendments and additions to the Bill
ga: Is féidir le Baill na Dála athruithe a mholadh nó píosa a chuir leis an mbille le linn an ama seo

source: The Bill is then sent to committees to be examined section by section
ga: Cuirtear an Bille ansin chuig na Coistí chun go ndéanfar mionscrúdú ar gach rannóg ann féin

source: After the committee stage, more amendments may be made to the Bill
ga: Ina dhiaidh sin is féidir leasú a dhéanamh ar an mBille, freisin

source: This is known as the report stage
ga: Tugtar céim na tuarascála air

source: The final stage in the process is a debate in the Dáil, confined to the contents of the Bill
ga: Níl fágtha, ansin, ach go ndéanfaí díospóireacht sa Dáil ar ábhar an Bhille

source: The members of the Dáil will then vote on whether to pass the Bill
ga: Caithfidh Baill na Dála vóta, ansin, i bhfábhar an Bhille nó ina aghaidh

source: The Bill will then be sent down to the Seanad to go through the entire process of debate and committee examination again
ga: Téann an Bille ansin chuig an Seanad chun dul tríd an bpróiséas céanna aríst maidir le díospóireacht agus le Coistí

source: The Seanad has 90 days (or any longer period agreed by both Houses) to consider the Bill and do one of the following:
ga: Tá 90 lá ag an Seanad (nó níos mó má aontaíonn an dá Theach Oireachtais air) chun an Bille a phlé agus ceann díobh seo a leanas a dhéanamh:

source: • Pass the Bill without any amendment or
ga: • Glacadh leis an mBille gan aon leasú a dhéanamh nó

source: • Reject the Bill completely or
ga: • An Bille a chaitheamh amach ina iomlán nó

source: • Return the Bill to the Dáil with amendments
ga: • An Bille a chuir ar ais chun na Dála chun leasuithe a dhéanamh ar an mBille

source: If the Seanad rejects the Bill or returns it to the Dáil with amendments that the Dáil does not accept, the Bill will lapse after 180 days
ga: Má chaitheann an Seanad amach an Bille nó má chuireann said an Bille ar ais chun na Dála le leasuithe nach nglacfaidh an Dáil leo imíonn an Bille as feidhm tar éis 180 lá

source: The Dáil may, within those 180 days, pass a resolution declaring that the Bill is deemed to have been passed by both Houses
ga: Is féidir leis an Dáil, áfach, taobh istigh den tréimhse ama sin rún a chuir ós cómhair na Dála ag rá go bhfuil glactha leis an reachtú ag an Seanad agus an Dáil

source: This provision means that the Seanad cannot generally stop the Dáil from introducing legislation – it can only cause delays
ga: Cialaíonn an riail seo nach féidir leis an Seanad an Dáil a stopadh ag cuir dlíthe i bhfeidhm ach gur féidir leo moill a chuir ar an reachtú

source: Money Bills are Bills that relate to taxation or relate to spending by the Government
ga: Billí Airgid a thugtar ar bhillí a bhaineann le Cáin nó le caiteachas an Rialtais

source: The Seanad has only 21 days to consider these Bills
ga: Níl ach 21 lá ag an Seanad chun an cinéal seo Billí a phlé agus cinneadh a dhéanamh futhu

source: Once the Bill has been passed by both Houses, the Taoiseach presents a copy of the Bill to the President for signature. Once the President has signed the Bill it becomes an Act and has legal force
ga: Nuair a ghlacann an dá theach leis an mBille, tugann an Taoiseach cóip den Bhille chuig an Uachtarán chun síniú agus ansin is Acht atá sa Bhille agus tá cumhacht dlí aige

source: You can view all Irish legislation 1922 to date here
ga: Féadfaidh tú iomlán reachtaíocht Éireannach ó 1922 go dtí sin a fheiceáil

source: When the Bill comes to the President for signature, they do have an important power
ga: Nuair tagann an Bille chuig an Uachtarán chun síniú, tá cumhacht faoi leith ag an Uachtarán maidir leis an mBille

source: If they consider that the new Bill may conflict with the Constitution, they may, after consultation with the Council of State, refer the question of whether or not the Bill is constitutional to the Supreme Court
ga: Má cheapann sé nó sí go bhfuil an Bille Nua in aghaidh an Bhunreachta , is féidir leis nó léi tar éis comhairle a fháil ón gComhairle Stáit, an Bille a chuir ar aghaidh chuig an gCúirt Uachtarach chun a chinntiú nach bhfuil an Bille ag dul in aghaidh an Bhunreachta

source: The Supreme Court must then decide whether or not the Bill is constitutional before it can be made law
ga: Ní dhéanfar dlí den Bhille go dtí go ndeireann an Chúirt Uachtarach go bhfuil an Bille ag cloí leis an mBunreacht
